#+title: Readme


#+begin_src shell
curl http://127.0.0.1:8000

#+end_src

#+RESULTS:
: {"Hello":"World"}


#+begin_src shell
curl http://127.0.0.1:8000/json

#+end_src

#+RESULTS:
: /home/luxa/projects/luxadevi/fastmid

#+begin_src bash :results output replace :wrap "src json" :exports results
curl -s http://127.0.0.1:8000/shell/uv

#+end_src
#+begin_src bash :results output replace :wrap "src json" :exports results :async
curl -s http://127.0.0.1:8000/shell/btop| jq . # Using jq for pretty-printing
#+end_src

#+RESULTS:
#+begin_src json
"ifailed"
#+end_src

#+begin_src bash :results output replace :wrap "src json" :exports results :async
curl -X 'GET' \
  'http://127.0.0.1:8000/arg' \
  -H 'accept: application/json' \
  -H 'Content-Type: application/json' \
  -d '{
  "command": "ls",
  "argumens": " -alh"
}'

#+end_src

#+RESULTS:
#+begin_src json
{"args":"ls -alh","returncode":0,"stdout":"total 128K\ndrwxr-xr-x 5 luxa users 4,0K apr 27 18:08 .\ndrwxr-xr-x 8 luxa users 4,0K apr 27 15:54 ..\ndrwxr-xr-x 7 luxa users 4,0K apr 27 17:55 .git\n-rw-r--r-- 1 luxa users 3,4K apr 27 15:54 .gitignore\n-rw-r--r-- 1 luxa users 2,0K apr 27 19:41 love\n-rw-r--r-- 1 luxa users 1,5K apr 27 19:45 main.py\ndrwxr-xr-x 2 luxa users 4,0K apr 27 19:45 __pycache__\n-rw-r--r-- 1 luxa users 1,3K apr 27 18:28 pyproject.toml\n-rw-r--r-- 1 luxa users    5 apr 27 15:54 .python-version\n-rw-r--r-- 1 luxa users   29 apr 27 15:54 README.md\n-rw-r--r-- 1 luxa users  975 apr 27 19:46 readme.org\n-rw-r--r-- 1 luxa users  77K apr 27 18:28 uv.lock\ndrwxr-xr-x 4 luxa users 4,0K apr 27 15:56 .venv\n","stderr":""}
#+end_src

#+begin_src bash :results output replace :wrap "src text" :exports results :async
curl -X 'GET' \
  'http://127.0.0.1:8000/arg' \
  -H 'accept: application/json' \
  -H 'Content-Type: application/json' \
  -d '{
  "command": "ls",
  "argumens": " -alh"
}' | jq -r '.stdout' # Pipe to jq to extract raw stdout

#+end_src

#+RESULTS:
#+begin_src text
total 128K
drwxr-xr-x 5 luxa users 4,0K apr 27 18:08 .
drwxr-xr-x 8 luxa users 4,0K apr 27 15:54 ..
drwxr-xr-x 7 luxa users 4,0K apr 27 17:55 .git
-rw-r--r-- 1 luxa users 3,4K apr 27 15:54 .gitignore
-rw-r--r-- 1 luxa users 2,0K apr 27 19:41 love
-rw-r--r-- 1 luxa users 1,5K apr 27 19:45 main.py
drwxr-xr-x 2 luxa users 4,0K apr 27 19:45 __pycache__
-rw-r--r-- 1 luxa users 1,3K apr 27 18:28 pyproject.toml
-rw-r--r-- 1 luxa users    5 apr 27 15:54 .python-version
-rw-r--r-- 1 luxa users   29 apr 27 15:54 README.md
-rw-r--r-- 1 luxa users  975 apr 27 19:46 readme.org
-rw-r--r-- 1 luxa users  77K apr 27 18:28 uv.lock
drwxr-xr-x 4 luxa users 4,0K apr 27 15:56 .venv

#+end_src

#+begin_src bash :results output replace :wrap "src text" :exports results :async
curl -X 'GET' \
  'http://127.0.0.1:8000/arg' \
  -H 'accept: application/json' \
  -H 'Content-Type: application/json' \
  -d '{
  "command": "docker run",
  "argumens": "--rm --network=host datmanslo/catt --cast"
}' | jq -r '.stdout' # Pipe to jq to extract raw stdout

#+end_src

docker run --rm --network=host datmanslo/catt cast https://www.youtube.com/watch?v=7t2alSnE2-I
#+RESULTS:
#+begin_src text

#+end_src

#+begin_src bash :results output replace :wrap "src text" :exports results :async
curl -X 'GET' \
  'http://127.0.0.1:8000/arg' \
  -H 'accept: application/json' \
  -H 'Content-Type: application/json' \
  -d '{
  "command": "ls",
  "argumens": "-alh"
}' | jq -r '"Args: \(.args)\nReturn Code: \(.returncode)\nStderr: \(.stderr)\n---\nStdout:\n\(.stdout)"'

#+end_src

#+RESULTS:
#+begin_src text
Args: null
Return Code: null
Stderr: null
---
Stdout:
null
#+end_src

#+begin_src bash :results output replace :wrap "src text" :exports results :async
curl -X 'GET' \
  'http://127.0.0.1:8000/arg' \
  -H 'accept: application/json' \
  -H 'Content-Type: application/json' \
  -d '{
  "token": "c58330aaaa224b444e89f9e3a5adc1a91b28603d87bda74b68ee7b0ce3d3e79a",
  "command": "ls",
  "argumens": "-alh"
}'
#+end_src

#+RESULTS:
#+begin_src text
#+end_src

#+begin_src bash :results output replace :wrap "src text" :exports results :async
curl -X 'GET' \
  'http://127.0.0.1:8000/cast \
  -H 'accept: application/json' \
  -H 'Content-Type: application/json' \
  -d '{
  "website": "https://www.youtube.com/watch?v=7t2alSnE2-I",
}' | jq -r '"Args: \(.args)\nReturn Code: \(.returncode)\nStderr: \(.stderr)\n---\nStdout:\n\(.stdout)"'

#+end_src

#+RESULTS:
#+begin_src text
#+end_src
